---
kind: property
id: P:Autodesk.Revit.DB.FamilySymbolProfile.Angle
source: html/0ae4c1a4-7eb0-f4d9-32df-55e46c9248c3.htm
---
# Autodesk.Revit.DB.FamilySymbolProfile.Angle Property

The angle of the rotation of the profile in radians.

## Syntax (C#)
```csharp
public double Angle { get; set; }
```